local BuffStateEnum = {

	State1001 = 1001;--攻击增强
	State1002 = 1002;--防御增强
	State1003 = 1003;--加速
	State1004 = 1004;--暴击率增强
	State1005 = 1005;--抗暴增强
	State1006 = 1006;--暴击伤害增加
	State1007 = 1007;--命中增强
	State1008 = 1008;--效果命中增强
	State1009 = 1009;--效果抵抗增强
	State1010 = 1010;--生命上限增加
	State1011 = 1011;--持续回血
	State1012 = 1012;--治疗翻倍
	State1013 = 1013;--护盾
	State1014 = 1014;--免疫
	State1015 = 1015;--隐身
	State1016 = 1016;--反击
	State1017 = 1017;--反弹
	State1018 = 1018;--不屈
	State1019 = 1019;--护卫
	State1020 = 1020;--灵魂守护
	State1021 = 1021;--无敌
	State1022 = 1022;--转移生命护盾
	State1023 = 1023;--转移伤害护盾

	State2001 = 2001;--攻击降低
	State2002 = 2002;--防御降低
	State2003 = 2003;--减速
	State2004 = 2004;--暴击率降低
	State2005 = 2005;--抗暴降低
	State2006 = 2006;--暴击伤害降低
	State2007 = 2007;--命中降低
	State2008 = 2008;--效果命中降低
	State2009 = 2009;--效果抵抗降低
	State2010 = 2010;--生命上限降低
	State2011 = 2011;--减少攻击条15
	State2012 = 2012;--嘲讽
	State2013 = 2013;--中毒
	State2014 = 2014;--破坏血量上限
	State2015 = 2015;--禁回血
	State2016 = 2016;--禁增益BUFF
	State2017 = 2017;--禁被动
	State2018 = 2018;--禁复活
	State2019 = 2019;--眩晕
	State2020 = 2020;--封印
	State2021 = 2021;--石化
	State2022 = 2022;--魅惑
	State2023 = 2023;--昏睡
	State2024 = 2024;--弱点
	State2025 = 2025;--治疗效果下降
	State2026 = 2026;--中毒效果加深
}
	
return BuffStateEnum;
